# YOLOv8-CBAM 模型配置文件（保守版）
# 仅在 Backbone 的 SPPF 之前插入一个 CBAM，避免复杂的索引问题
# 这样可以确保 head 的索引与标准 YOLOv8s 完全一致

nc: 2  # number of classes: insulator, broken_part

# YOLOv8 backbone with CBAM（仅在关键位置插入）
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]   # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]   # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]   # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]  # 8
  - [-1, 1, CBAM, [1024]]       # 9 - 在 SPPF 前插入 CBAM
  - [-1, 1, SPPF, [1024, 5]]    # 10

# YOLOv8 head（完全使用标准配置，但需要修正索引以匹配新的 backbone）
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 0: Upsample SPPF (1/32 -> 1/16)
  - [[-1, 6], 1, Concat, [1]]   # 1: cat Upsample(-1) with backbone[6] (P4, C2f[512], 1/16)
  - [-1, 3, C2f, [512]]         # 2: (1/16)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 3: Upsample (1/16 -> 1/8)
  - [[-1, 4], 1, Concat, [1]]   # 4: cat Upsample(-1) with backbone[4] (P3, C2f[256], 1/8)
  - [-1, 3, C2f, [256]]         # 5: (P3/8-small, 1/8)
  - [-1, 1, Conv, [256, 3, 2]]  # 6: Downsample (1/8 -> 1/16)
  # 关键修正：这里要拼接的是 head 的第 2 层输出（整体索引会随 backbone 长度变化）
  # 标准 yolov8s.yaml 中这里是 12；我们 backbone 比标准多 1 层，所以整体索引 +1 => 13
  - [[-1, 13], 1, Concat, [1]]  # 7: cat Conv(-1, 1/16) with head[2] (C2f[512], 1/16)
  - [-1, 3, C2f, [512]]         # 8: (P4/16-medium, 1/16)
  - [-1, 1, Conv, [512, 3, 2]]  # 9: Downsample (1/16 -> 1/32)
  - [[-1, 10], 1, Concat, [1]]  # 10: cat Conv(-1, 1/32) with backbone[10] (SPPF, 1/32)
  - [-1, 3, C2f, [1024]]        # 11: (P5/32-large, 1/32)
  # Detect 的 from 也是“整体索引”，同理整体 +1
  - [[16, 19, 22], 1, Detect, [nc]]  # 12: Detect(P3,P4,P5) = (head[5], head[8], head[11]) => (16,19,22)
